In [1]:
# Import pandas package
import pandas as pd
  
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
  
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Age': [27, 24, 22, 32],
 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
 'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

In [4]:
#Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [5]:
# select two columns #从四列中选出两列 用双引号把要选的列的名称输入
df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [8]:
# select all rows 
# and second to fourth column 选出第2到4列，序列号是1到4但是不包括4
df[df.columns[1:4]]

   Age    Address Qualification
0   27      Delhi           Msc
1   24     Kanpur            MA
2   22  Allahabad           MCA
3   32    Kannauj           Phd

# Method #2: Using loc[]

In [9]:
# select three rows and two columns #选出三行，1代表第二行，3代表第四行，不包括第4行，所以取第二行和第三行
df.loc[1:3, ['Name', 'Qualification']]

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [10]:
# select two rows and 
# column "name" to "Address" 从这个列到另外一个列，这里是三列
df.loc[0:1, 'Name':'Address']

     Name  Age Address
0     Jai   27   Delhi
1  Princi   24  Kanpur

In [11]:
# .loc DataFrame method
# filtering rows and selecting columns by label
# format
# df.loc[rows, columns]
# row 1, all columns
df.loc[0, :]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

# Method #3: Using iloc[]

In [12]:
# Remember that Python does not
# slice inclusive of the ending index.
# select all rows 选所有的行
# select first two column 选其中的两列
df.iloc[:, 0:2]

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32

In [13]:
# iloc[row slicing, column slicing]
df.iloc [0:2, 1:3]

   Age Address
0   27   Delhi
1   24  Kanpur

# 查询数据
df.loc 方法，根据行、列的标签值查询。

df.iloc 方法，根据行、列的数索引查询。

In [15]:
# select all rows and 0 to 2 columns 
import pandas as pd
print(df.ix[:, 0:2])

AttributeError: 'DataFrame' object has no attribute 'ix'